#6 Реализовать два небольших скрипта:
#а) итератор, генерирующий целые числа, начиная с указанного,
#б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
#Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

#только первая часть

from itertools import count

limit = int(input('Введите число чисел в последовательности: '))
cnt = 0
for n in count(int(input('Введите начальное число '))):
    cnt = cnt + 1
    print(n)
    if cnt >= limit:
        cnt = 0
        break

